$\textbf{DS165-L - DATA ANALYTICS LABORATORY} \\ \texttt{SY2425}$

NAME: MA. ADDINE ANNE T. CARREON
 
SECTION: AM14

In [1]:
import numpy as np
import pandas as pd

### Question 1

In [2]:
# Created the given data frame using suitable commands
data = {
        'column-a': pd.Series(['a', 'b', 'c', 'd']),
        'column-b': np.arange(2, 12, 3, dtype='int'), 
        'column-c': np.arange(1, 5, 1, dtype='int'),
        'column-d': np.arange(3, 7, 1, dtype='int'),
        'column-e': np.arange(3, 7, 1, dtype='float'),
        'column-f': pd.Series(['h', 'i', 'j', 'k']),
        'column-g': ["2020-01-01 00:00:00-05:00", "2020-01-02 00:00:00-05:00", 
                     "2020-01-03 00:00:00-05:00", "2020-01-04 00:00:00-05:00"],
        'column-h': ["2020-01-01 00:00:00.00000000", "2020-01-01 00:00:00.00000001", 
                     "2020-01-01 00:00:00.00000002", "2020-01-01 00:00:00.00000003"],
        'column-i': [True, False, False, True]
    }

df = pd.DataFrame(data)
display(df)

,column-a,column-b,column-c,column-d,column-e,column-f,column-g,column-h,column-i
0,a,2,1,3,3.0,h,2020-01-01 00:00:00-05:00,2020-01-01 00:00:00.00000000,True
1,b,5,2,4,4.0,i,2020-01-02 00:00:00-05:00,2020-01-01 00:00:00.00000001,False
2,c,8,3,5,5.0,j,2020-01-03 00:00:00-05:00,2020-01-01 00:00:00.00000002,False
3,d,11,4,6,6.0,k,2020-01-04 00:00:00-05:00,2020-01-01 00:00:00.00000003,True

### Question 2

#### Task 1

In [3]:
# Read rows 3-12 and named it as 'df' 
df = pd.read_excel('assignment-data.xlsx').loc[2:11].reset_index(drop=True)
df

,tweet_id,created_at,tweet,retweets,username
0,832516558903730176,2017-02-17 09:06:29,@comark yes check the flux capacitor in our lo...,0,88mph_Africa
1,832293187670704128,2017-02-16 18:18:53,RT @iafrikan: .@88mph_Africa stopped running i...,1,88mph_Africa
2,831880802489217024,2017-02-15 15:00:13,88mph invest in Ahoy - a business travel app f...,1,88mph_Africa
3,946063916068634631,2017-12-27 17:03:09,"Ce samedi 30 décembre 2017 à @ActivSpaces, se ...",4,ActiveSpaces
4,945973955847999488,2017-12-27 11:05:41,RT @OIFfrancophonie: Retour en vidéo sur la vi...,27,ActiveSpaces
5,945972004548726785,2017-12-27 10:57:55,RT @OIFfrancophonie: L’OIF a organisé un ateli...,13,ActiveSpaces
6,945606558930690048,2017-12-26 10:45:46,Plus que deux jours et les inscriptions seront...,5,ActiveSpaces
7,945595453256687616,2017-12-26 10:01:39,RT @nlend_nyounai: Transform your idea into a ...,1,ActiveSpaces
8,945595401729724416,2017-12-26 10:01:26,RT @ElongWilliam: Si tu as une idée et tu es u...,6,ActiveSpaces
9,944304498461347840,2017-12-22 20:31:51,RT @chantaledie: AWESOME https://t.co/pTu3k5LA81,2,ActiveSpaces

In [4]:
# Display the type of dataset
print(type(df))

<class 'pandas.core.frame.DataFrame'>

#### Task 2

In [5]:
# Masked specific sensitive columns
df.rename(columns={'tweet_id': 'new_tweet_id', 'created_at': 'created_at4'}, inplace=True)
df['created_at4'] = pd.to_datetime(df['created_at4']).dt.strftime('%A/%B/%d')
df['username'] = 'yyy'
df.drop(df.columns[2:4], axis=1, inplace=True)
df.iloc[0:10]

         new_tweet_id            created_at4 username
0  832516558903730176     Friday/February/17      yyy
1  832293187670704128   Thursday/February/16      yyy
2  831880802489217024  Wednesday/February/15      yyy
3  946063916068634631  Wednesday/December/27      yyy
4  945973955847999488  Wednesday/December/27      yyy
5  945972004548726785  Wednesday/December/27      yyy
6  945606558930690048    Tuesday/December/26      yyy
7  945595453256687616    Tuesday/December/26      yyy
8  945595401729724416    Tuesday/December/26      yyy
9  944304498461347840     Friday/December/22      yyy

### Question 3

In [6]:
# Load the first 200 rows called 'dataset'
dataset = pd.read_excel("assignment-data.xlsx", sheet_name="online-retail", nrows=200)

#### Task 1

In [7]:
# Data Cleaning
ncols = dataset.select_dtypes(include=['number'])
bfr = (ncols < 0).values.any()
clean_df = dataset[(ncols >= 0).all(axis=1)]
aft = (clean_df.select_dtypes(include=['number']) < 0).values.any()

print(f"Before cleaning: any negatives?: \033[1m{bfr}\033[0m")
print(f"After cleaning: any negatives?: \033[1m{aft}\033[0m")

Before cleaning: any negatives?: True
After cleaning: any negatives?: False

#### Task 2

In [8]:
# Find Customer with most number of transactions
transcount = clean_df.groupby('CustomerID').size()
mt_customer = transcount.idxmax()
mt_count = transcount.max()

print(f"Hurray! The most number of transactions is done by Customer ID: \033[1m{mt_customer}\033[0m. He has made \033[1m{mt_count}\033[0m transactions. He will be rewarded with our gift hamper worth 1000 pesos.")

Hurray! The most number of transactions is done by Customer ID: 17850. He has made 45 transactions. He will be rewarded with our gift hamper worth 1000 pesos.

#### Task 3

In [9]:
# Find Customer with highest amount of total purchase amount
clean2 = clean_df.copy()
clean2['TotalAmount'] = clean2['UnitPrice'] * clean2['Quantity']
tpa = clean2.groupby('CustomerID')['TotalAmount'].sum()
bc = tpa.idxmax()
bca = tpa.max()

print(f"Customer ID: \033[1m{bc}\033[0m is the best customer since he has spent a lot on our business. His total purchase amount is \033[1m{bca:.2f}\033[0m pesos. 50% discount will be given on his next purchase.")

Customer ID: 16029 is the best customer since he has spent a lot on our business. His total purchase amount is 3702.12 pesos. 50% discount will be given on his next purchase.

#### Task 4

In [10]:
# Find the most and the least bought items
quanitems = clean_df.groupby('StockCode')['Quantity'].sum()
mbi = quanitems.idxmax()
mbq = quanitems.max()
lbi = quanitems.idxmin()
lbq = quanitems.min()

print(f"Most bought item is StockCode \033[1m{mbi}\033[0m with \033[1m{mbq}\033[0m in purchased quantity.")
print(f"Least bought item is StockCode \033[1m{lbi}\033[0m with \033[1m{lbq}\033[0m in purchased quantity overall. These two items can be bundled and provide 10% discount on this bundle to increase the sale of StockCode \033[1m{lbi}\033[0m.")

Most bought item is StockCode 21731 with 458 in purchased quantity.
Least bought item is StockCode 21166 with 1 in purchased quantity overall. These two items can be bundled and provide 10% discount on this bundle to increase the sale of StockCode 21166.

#### Task 5

In [11]:
# Find the overall average purchase-amount among all transactions
trans_tot = clean2.groupby('InvoiceNo')['TotalAmount'].sum()
apa = trans_tot.mean()

print(f"Average purchase amount among all transactions = \033[1m{apa:.2f}.\033[0m")

Average purchase amount among all transactions = 384.60.

#### Task 6

In [12]:
# Create new data frame called 'new-dataset' and display last 10 rows
new_dataset = clean2.groupby('CustomerID').agg(
    TotalPurchaseAmount=('TotalAmount', 'sum'),
    NumberofTransactions=('InvoiceNo', 'count')
).reset_index()

new_dataset.index += 1
display(new_dataset.tail(10))

    CustomerID  TotalPurchaseAmount  NumberofTransactions
6        15100               350.40                     1
7        15291               328.80                     2
8        15311               449.98                    35
9        16029              3702.12                     8
10       16098               430.60                    12
11       16250               226.14                    14
12       17420               130.85                     7
13       17809                34.80                     1
14       17850               725.44                    45
15       18074               489.60                    13

#### Task 7

In [13]:
# Know the average purchase amount made by every customer
new_dataset['AveragePurchase'] = new_dataset['TotalPurchaseAmount'] / new_dataset['NumberofTransactions']
new_dataset.index -= 1

new_dataset.head(5)

   CustomerID  TotalPurchaseAmount  NumberofTransactions  AveragePurchase
0       12431               105.60                     3        35.200000
1       12583               855.86                    20        42.793000
2       13047               366.63                    17        21.566471
3       13748               204.00                     1       204.000000
4       14688               444.98                    19        23.420000

***
***